marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey.cpp
  // White Balance and Tint
  // WB: Bright, Incandescent, Fluorescent, Mixed Light, Cloud

  // Get the current White Balance value
  int currentWB = 0;
  if(camera->hasWhiteBalance())
    currentWB = camera->getWhiteBalance();

  // Get the current Tint value
  int currentTint = 0;
  if(camera->hasTint())
    currentTint = camera->getTint();

  // If we have an up/down button press
  bool tappedAction = false;
  if((btnAPressed || btnBPressed) && camera->hasWhiteBalance() && camera->hasTint())
  {
    DEBUG_DEBUG("White Balance Screen: Btn A/B pressed");

    if(editWB) // White Balance Edit
    {
      if(btnAPressed)
      {
        // White Balance Presets

        std::vector<int> Options_WB = {5600, 3200, 4000, 4500, 6500};
        std::vector<int> Options_WB_Tint = {10, 0, 15, 15, 10}; // Corresponding Tints for WB presets
        int Options_WB_SelectingIndex = -1; // when using up/down buttons keeps track of what option you are navigating to

        // Get the current White Balance
        int currentValue = currentWB;

        bool up = true;

        // If we don't have a selected value yet, set to the current one
        if(Options_WB_SelectingIndex == -1)
        {
          auto iter = std::find(Options_WB.begin(), Options_WB.end(), currentValue);
          int index = (iter != Options_WB.end()) ? std::distance(Options_WB.begin(), iter) : -1;

          if(index != -1)
            Options_WB_SelectingIndex = index;
          else // Custom Shutter Speed, use the latest one
          {
            int closestIndex = -1;
            int closestValue = std::numeric_limits<int>::min();  // Initialize with the lowest possible value

            for (int i = 0; i < Options_WB.size(); ++i) {
                int optionValue = Options_WB[i];

                if (optionValue <= currentValue && optionValue > closestValue) {
                    closestIndex = i;
                    closestValue = optionValue;
                }
            }

            if (closestIndex != -1)
            {
              if(up)
                Options_WB_SelectingIndex = closestIndex; // Pressing up, closest one lower is right
              else
              {
                if(closestIndex < Options_WB.size() - 1)
                  Options_WB_SelectingIndex = closestIndex + 1; // Pressing down, go up
                else
                  Options_WB_SelectingIndex = 0; // Already at the top, so go back to the start
              }
            }
            else // Lower than the lowest, so set to lowest in options
            {
              if(up)
                Options_WB_SelectingIndex = Options_WB.size() - 1; // Pressing up on a number lower than the lowest, put on the highest so we can go back around to the lowest in the set
              else
                Options_WB_SelectingIndex = 0; // Otherwise pressing down and keep at the lowest and we'll be going to the highest
            }
          }
        }

        // Move to the next option and send it to the camera
        if(Options_WB_SelectingIndex != -1)
        {
          Options_WB_SelectingIndex = Options_WB_SelectingIndex + (up ? 1 : -1); // Move the selected option

          if(Options_WB_SelectingIndex < 0)
          {
            // Down button on the first option, go to the last option
            Options_WB_SelectingIndex = Options_WB.size() -1;
          }
          else if(Options_WB_SelectingIndex > (Options_WB.size() - 1))
          {
            // Up button on the last option, go to the first option
            Options_WB_SelectingIndex = 0;
          }

          // Shutter Speed selected, send it to the camera
          PacketWriter::writeWhiteBalance(Options_WB[Options_WB_SelectingIndex], Options_WB_Tint[Options_WB_SelectingIndex], &cameraConnection);

          tappedAction = true;
        }
      }
      else
      {
        // White Balance +100
        int newWB = currentWB + 100;

        if(newWB > 10000)
          newWB = 2500;

          // Shutter Speed selected, send it to the camera
          PacketWriter::writeWhiteBalance(newWB, currentTint, &cameraConnection);

          tappedAction = true;
      }
    }
    else if(!editWB && camera->hasTint())
    {
      std::vector<int> Options_Tint = {-50, -40, -30, -20, -15, -10, -9, -8, -7, -6, -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 15, 20, 30, 40, 50};
      int Options_Tint_SelectingIndex = -1; // when using up/down buttons keeps track of what option you are navigating to

      // Get the current Tint
      int currentValue = currentTint;

      bool up = btnBPressed; // up = true, down = false

      // If we don't have a selected value yet, set to the current one
      if(Options_Tint_SelectingIndex == -1)
      {
        auto iter = std::find(Options_Tint.begin(), Options_Tint.end(), currentValue);
        int index = (iter != Options_Tint.end()) ? std::distance(Options_Tint.begin(), iter) : -1;

        if(index != -1)
          Options_Tint_SelectingIndex = index;
        else // Custom Shutter Speed, use the latest one
        {
          int closestIndex = -1;
          int closestValue = std::numeric_limits<int>::min();  // Initialize with the lowest possible value

          for (int i = 0; i < Options_Tint.size(); ++i) {
              int optionValue = Options_Tint[i];

              if (optionValue <= currentValue && optionValue > closestValue) {
                  closestIndex = i;
                  closestValue = optionValue;
              }
          }

          if (closestIndex != -1)
          {
            if(up)
              Options_Tint_SelectingIndex = closestIndex; // Pressing up, closest one lower is right
            else
            {
              if(closestIndex < Options_Tint.size() - 1)
                Options_Tint_SelectingIndex = closestIndex + 1; // Pressing down, go up
              else
                Options_Tint_SelectingIndex = 0; // Already at the top, so go back to the start
            }
          }
          else // Lower than the lowest, so set to lowest in options
          {
            if(up)
              Options_Tint_SelectingIndex = Options_Tint.size() - 1; // Pressing up on a number lower than the lowest, put on the highest so we can go back around to the lowest in the set
            else
              Options_Tint_SelectingIndex = 0; // Otherwise pressing down and keep at the lowest and we'll be going to the highest
          }
        }
      }

      // Move to the next option and send it to the camera
      if(Options_Tint_SelectingIndex != -1)
      {
        Options_Tint_SelectingIndex = Options_Tint_SelectingIndex + (up ? 1 : -1); // Move the selected option

        if(Options_Tint_SelectingIndex < 0)
        {
          // Down button on the first option, go to the last option
          Options_Tint_SelectingIndex = Options_Tint.size() -1;
        }
        else if(Options_Tint_SelectingIndex > (Options_Tint.size() - 1))
        {
          // Up button on the last option, go to the first option
          Options_Tint_SelectingIndex = 0;
        }

        // Shutter Speed selected, send it to the camera
        PacketWriter::writeWhiteBalance(currentWB, Options_Tint[Options_Tint_SelectingIndex], &cameraConnection);

        tappedAction = true;
      }
    }
  }

  // If the screen hasn't changed, there were no touch events and we don't have to refresh, return.
  if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh && !tappedAction)
    return;
  else
    lastRefreshedScreen = camera->getLastModified();
  
  DEBUG_DEBUG("Screen WB Tint Refreshed.");

  sprite->fillScreen(TFT_BLACK);

  Screen_Common_Connected(); // Common elements

  // ISO label
  sprite->setTextColor(TFT_WHITE);
  sprite->drawString(editWB ? "WHITE BALANCE" : "TINT", 30, 9, &AgencyFB_Bold9pt7b);
  sprite->drawCentreString("TINT", 54, 132, &AgencyFB_Bold9pt7b);

  // Bright, 5600K
  int lblWBKelvin = 5600;
  int lblTint = 10;
  sprite->fillSmoothRoundRect(20, 30, 70, 40, 3, (currentWB == lblWBKelvin && currentTint == lblTint ? TFT_DARKGREEN : TFT_DARKGREY));
  if(currentWB == lblWBKelvin && currentTint == lblTint)
    sprite->pushImage(40, 35, 30, 30, WBBrightBG);
  else
    sprite->pushImage(40, 35, 30, 30, WBBright);

  // Incandescent, 3200K
  lblWBKelvin = 3200;
  lblTint = 0;
  sprite->fillSmoothRoundRect(95, 30, 70, 40, 3, (currentWB == lblWBKelvin && currentTint == lblTint ? TFT_DARKGREEN : TFT_DARKGREY));
  if(currentWB == lblWBKelvin && currentTint == lblTint)
    sprite->pushImage(115, 35, 30, 30, WBIncandescentBG);
  else
    sprite->pushImage(115, 35, 30, 30, WBIncandescent);

  // Fluorescent, 4000K
  lblWBKelvin = 4000;
  lblTint = 15;
  sprite->fillSmoothRoundRect(170, 30, 70, 40, 3, (currentWB == lblWBKelvin && currentTint == lblTint ? TFT_DARKGREEN : TFT_DARKGREY));
  if(currentWB == lblWBKelvin && currentTint == lblTint)
    sprite->pushImage(190, 35, 30, 30, WBFlourescentBG);
  else
    sprite->pushImage(190, 35, 30, 30, WBFlourescent);

  // Mixed Light, 4500K
  lblWBKelvin = 4500;
  lblTint = 15;
  sprite->fillSmoothRoundRect(245, 30, 70, 40, 3, (currentWB == lblWBKelvin && currentTint == lblTint ? TFT_DARKGREEN : TFT_DARKGREY));
  if(currentWB == lblWBKelvin && currentTint == lblTint)
    sprite->pushImage(265, 35, 30, 30, WBMixedLightBG);
  else
    sprite->pushImage(265, 35, 30, 30, WBMixedLight);

  // Cloud, 6500K
  lblWBKelvin = 6500;
  lblTint = 10;
  sprite->fillSmoothRoundRect(20, 75, 70, 40, 3, (currentWB == lblWBKelvin && currentTint == lblTint ? TFT_DARKGREEN : TFT_DARKGREY));
  if(currentWB == lblWBKelvin && currentTint == lblTint)
    sprite->pushImage(40, 80, 30, 30, WBCloudBG);
  else
    sprite->pushImage(40, 80, 30, 30, WBCloud);

  // Current White Balance Kelvin
  sprite->fillSmoothRoundRect(160, 75, 90, 40, 3, editWB ? TFT_DARKGREEN : TFT_DARKGREY);
  sprite->drawCentreString(String(currentWB), 205, 80);
  sprite->drawCentreString("KELVIN", 205, 103, &Lato_Regular5pt7b);

  if(editWB)
  {
    // WB Adjust Left <
    sprite->fillSmoothRoundRect(95, 75, 60, 40, 3, TFT_DARKGREY);
    sprite->drawCentreString("<", 125, 87);

    // WB Adjust Right >
    sprite->fillSmoothRoundRect(255, 75, 60, 40, 3, TFT_DARKGREY);
    sprite->drawCentreString(">", 284, 87);
  }

  // Current Tint
  sprite->fillSmoothRoundRect(160, 120, 90, 40, 3, !editWB ? TFT_DARKGREEN : TFT_DARKGREY);
  sprite->drawCentreString(String(currentTint), 205, 130);

  if(!editWB)
  {
    // Tint Adjust Left <
    sprite->fillSmoothRoundRect(95, 120, 60, 40, 3, TFT_DARKGREY);
    sprite->drawCentreString("<", 125, 132);

