marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey.cpp
    // Tint Adjust Right >
    sprite->fillSmoothRoundRect(255, 120, 60, 40, 3, TFT_DARKGREY);
    sprite->drawCentreString(">", 284, 132);
  }

  sprite->pushSprite(0, 0);
}

// Codec Screen for Pocket 4K and 6K + Variants
void Screen_Codec4K6K(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Codec;

  auto camera = BMDControlSystem::getInstance()->getCamera();

  // Get the current Codec values
  CodecInfo currentCodec = camera->getCodec();

  // Codec: BRAW and ProRes

  // If we have an up/down button press
  bool tappedAction = false;
  if(btnAPressed || btnBPressed)
  {
    DEBUG_DEBUG("Codec 4K/6K: Btn A/B pressed");

    // Switching between BRAW and ProRes
    if(btnAPressed)
    {
      if(currentCodec.basicCodec == CCUPacketTypes::BasicCodec::BRAW)
      {
        // Switch to ProRes
        PacketWriter::writeCodec(camera->lastKnownProRes, &cameraConnection);
      }
      else
      {
        // Switch to BRAW
        PacketWriter::writeCodec(camera->lastKnownBRAWIsBitrate ? camera->lastKnownBRAWBitrate : camera->lastKnownBRAWQuality, &cameraConnection);
      }

      tappedAction = true;
    }
    else if(btnBPressed)
    {
        // Current setting
        std::string currentCodecString = currentCodec.to_string();

      // Change the setting on the current Codec
      if(currentCodec.basicCodec == CCUPacketTypes::BasicCodec::BRAW)
      {
          if(currentCodecString == "BRAW 3:1")
          {
            PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::BRAW, CCUPacketTypes::CodecVariants::kBRAW5_1), &cameraConnection);
          }
          else if(currentCodecString == "BRAW 5:1")
          {
            PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::BRAW, CCUPacketTypes::CodecVariants::kBRAW8_1), &cameraConnection);
          }
          else if(currentCodecString == "BRAW 8:1")
          {
            PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::BRAW, CCUPacketTypes::CodecVariants::kBRAW12_1), &cameraConnection);
          }
          else if(currentCodecString == "BRAW 12:1")
          {
            // Switch across to Constant Quality
            PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::BRAW, CCUPacketTypes::CodecVariants::kBRAWQ0), &cameraConnection);
          }
          else if(currentCodecString == "BRAW Q0")
          {
            PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::BRAW, CCUPacketTypes::CodecVariants::kBRAWQ1), &cameraConnection);
          }
          else if(currentCodecString == "BRAW Q1")
          {
            PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::BRAW, CCUPacketTypes::CodecVariants::kBRAWQ3), &cameraConnection);
          }
          else if(currentCodecString == "BRAW Q3")
          {
            PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::BRAW, CCUPacketTypes::CodecVariants::kBRAWQ5), &cameraConnection);
          }
          else if(currentCodecString == "BRAW Q5")
          {
            // Switch across to Constant Bitrate
            PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::BRAW, CCUPacketTypes::CodecVariants::kBRAW3_1), &cameraConnection);
          }
      }
      else
      {
          if(currentCodecString == "ProRes HQ")
          {
            PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::ProRes, CCUPacketTypes::CodecVariants::kProRes422), &cameraConnection);
          }
          else if(currentCodecString == "ProRes 422")
          {
            PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::ProRes, CCUPacketTypes::CodecVariants::kProResLT), &cameraConnection);
          }
          else if(currentCodecString == "ProRes LT")
          {
            PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::ProRes, CCUPacketTypes::CodecVariants::kProResProxy), &cameraConnection);
          }
          else if(currentCodecString == "ProRes PXY")
          {
            PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::ProRes, CCUPacketTypes::CodecVariants::kProResHQ), &cameraConnection);
          }
      }

      tappedAction = true;
    }
  }

  // If the screen hasn't changed, there were no touch events and we don't have to refresh, return.
  if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh && !tappedAction)
    return;
  else
    lastRefreshedScreen = camera->getLastModified();
  
  DEBUG_DEBUG("Screen Codec 4K/6K Refreshed.");

  sprite->fillScreen(TFT_BLACK);

  Screen_Common_Connected(); // Common elements

  // We need to have the Codec information to show the screen
  if(!camera->hasCodec())
  {
    sprite->setTextColor(TFT_WHITE);
    sprite->drawString("NO CODEC INFO.", 30, 9);

    return;
  }

  // Codec label
  sprite->setTextColor(TFT_WHITE);
  sprite->drawString("CODEC", 30, 9, &AgencyFB_Bold9pt7b);

  // BRAW and ProRes selector buttons

  // BRAW
  sprite->fillSmoothRoundRect(20, 30, 145, 40, 5, (currentCodec.basicCodec == CCUPacketTypes::BasicCodec::BRAW ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawRoundRect(20, 30, 145, 40, 3, (currentCodec.basicCodec == CCUPacketTypes::BasicCodec::BRAW ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString("BRAW", 93, 41);

  // ProRes
  sprite->fillSmoothRoundRect(170, 30, 145, 40, 5, (currentCodec.basicCodec == CCUPacketTypes::BasicCodec::ProRes ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawRoundRect(170, 30, 145, 40, 3, (currentCodec.basicCodec == CCUPacketTypes::BasicCodec::ProRes ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString("ProRes", 242, 41);

  if(currentCodec.basicCodec == CCUPacketTypes::BasicCodec::BRAW)
  {
    // BRAW

    // Are we Constant Bitrate or Constant Quality
    std::string currentCodecString = currentCodec.to_string();
    auto pos = std::find(currentCodecString.begin(), currentCodecString.end(), ':');
    bool isConstantBitrate = pos != currentCodecString.end(); // Is there a colon, :, in the string? If so, it's Constant Bitrate

