marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey.cpp
      if(width != 0)
      {
        // Resolution selected, write to camera
        CCUPacketTypes::RecordingFormatData newRecordingFormat = currentRecordingFormat;
        newRecordingFormat.width = width;
        newRecordingFormat.height = height;
        newRecordingFormat.windowedModeEnabled = window;
        PacketWriter::writeRecordingFormat(newRecordingFormat, &cameraConnection);

        tappedAction = true;
      }
    }
    else
    {
      // ProRes

      int width = 0;
      int height = 0;
      bool window = false;

      DEBUG_DEBUG("Before change:");
      DEBUG_DEBUG(currentRecordingFormat.frameDimensionsShort_string().c_str());
      DEBUG_DEBUG(currentRecordingFormat.frameRate_string().c_str());
      DEBUG_DEBUG("Frame Rate: %hi", currentRecordingFormat.frameRate);
      DEBUG_DEBUG("Off Speed Frame Rate: %hi", currentRecordingFormat.offSpeedFrameRate);
      DEBUG_DEBUG("Width: %i", currentRecordingFormat.width);
      DEBUG_DEBUG("Height: %i", currentRecordingFormat.height);
      DEBUG_DEBUG("mRateEnabled: %s", currentRecordingFormat.mRateEnabled ? "Yes" : "No");
      DEBUG_DEBUG("offSpeedEnabled: %s", currentRecordingFormat.offSpeedEnabled ? "Yes" : "No");
      DEBUG_DEBUG("interlacedEnabled: %s", currentRecordingFormat.interlacedEnabled ? "Yes" : "No");
      DEBUG_DEBUG("windowedModeEnabled: %s", currentRecordingFormat.windowedModeEnabled ? "Yes" : "No");
      DEBUG_DEBUG("sensorMRateEnabled: %s", currentRecordingFormat.sensorMRateEnabled ? "Yes" : "No");

      if(currentRes == "4K DCI")
      {
        if(btnAPressed)
        {
          // 4K UHD
          width = 3840; height = 2160;
          window = true;
        }
        else
        {
          // HD
          width = 1920; height = 1080;
          window = true;
        }
      }
      else if(currentRes == "4K UHD")
      {
        if(btnAPressed)
        {
          // HD
          width = 1920; height = 1080;
          window = true;
        }
        else
        {
          // 4K DCI
          width = 4096; height = 2160;
          window = false;
        }
      }
      else // UHD
      {
        if(btnAPressed)
        {
          // 4K DCI
          width = 4096; height = 2160;
          window = false;
        }
        else
        {
          // 4K UHD
          width = 3840; height = 2160;
          window = true;
        }
      }

      if(width != 0)
      {
        // Resolution or Sensor Area selected, write to camera
        CCUPacketTypes::RecordingFormatData newRecordingFormat = currentRecordingFormat;
        newRecordingFormat.width = width;
        newRecordingFormat.height = height;
        newRecordingFormat.windowedModeEnabled = window;

        DEBUG_DEBUG("Attempting to change to:");
        DEBUG_DEBUG(newRecordingFormat.frameDimensionsShort_string().c_str());
        DEBUG_DEBUG(newRecordingFormat.frameRate_string().c_str());
        DEBUG_DEBUG("Frame Rate: %hi", newRecordingFormat.frameRate);
        DEBUG_DEBUG("Off Speed Frame Rate: %hi", newRecordingFormat.offSpeedFrameRate);
        DEBUG_DEBUG("Width: %i", newRecordingFormat.width);
        DEBUG_DEBUG("Height: %i", newRecordingFormat.height);
        DEBUG_DEBUG("mRateEnabled: %s", newRecordingFormat.mRateEnabled ? "Yes" : "No");
        DEBUG_DEBUG("offSpeedEnabled: %s", newRecordingFormat.offSpeedEnabled ? "Yes" : "No");
        DEBUG_DEBUG("interlacedEnabled: %s", newRecordingFormat.interlacedEnabled ? "Yes" : "No");
        DEBUG_DEBUG("windowedModeEnabled: %s", newRecordingFormat.windowedModeEnabled ? "Yes" : "No");
        DEBUG_DEBUG("sensorMRateEnabled: %s", newRecordingFormat.sensorMRateEnabled ? "Yes" : "No");

        PacketWriter::writeRecordingFormat(newRecordingFormat, &cameraConnection);

        tappedAction = true;
      }
    }
  }

  // If the screen hasn't changed, there were no touch events and we don't have to refresh, return.
  if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh && !tappedAction)
    return;
  else
    lastRefreshedScreen = camera->getLastModified();
  
  DEBUG_DEBUG("Screen Resolution Pocket 4K Refreshed.");

  sprite->fillScreen(TFT_BLACK);

  Screen_Common_Connected(); // Common elements

  if(currentCodec.basicCodec == CCUPacketTypes::BasicCodec::BRAW)
  {
    // Main label
    sprite->setTextColor(TFT_WHITE);
    sprite->drawString("BRAW RESOLUTION", 30, 9, &AgencyFB_Bold9pt7b);

    String currentRes = currentRecordingFormat.frameDimensionsShort_string().c_str(); // "4K DCI", "4K 2.4:1", "4K UHD", "2.8K Ana", "2.6K 16:9", "HD"

    // 4K DCI
    String labelRes = "4K DCI";
    sprite->fillSmoothRoundRect(20, 30, 90, 40, 3, (currentRes == labelRes ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString("4K", 65, 35);
    sprite->drawCentreString("DCI", 65, 58, &Lato_Regular5pt7b);

    // 4K 2.4:1
    labelRes = "4K 2.4:1";
    sprite->fillSmoothRoundRect(115, 30, 90, 40, 3, (currentRes == labelRes ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString("4K", 160, 35);
    sprite->drawCentreString("2.4:1", 160, 58, &Lato_Regular5pt7b);

    // 4K UHD
    labelRes = "4K UHD";
    sprite->fillSmoothRoundRect(210, 30, 100, 40, 3, (currentRes == labelRes ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString("4K", 260, 35);
    sprite->drawCentreString("UHD", 260, 58, &Lato_Regular5pt7b);

    // 2.8K Ana
    labelRes = "2.8K Ana";
    sprite->fillSmoothRoundRect(20, 75, 90, 40, 3, (currentRes == labelRes ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString("2.8K", 65, 81);
    sprite->drawCentreString("ANAMORPHIC", 65, 104, &Lato_Regular5pt7b);

    // 2.6K 16:9
    labelRes = "2.6K 16:9";
    sprite->fillSmoothRoundRect(115, 75, 90, 40, 3, (currentRes == labelRes ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString("2.6K", 160, 81);
    sprite->drawCentreString("16:9", 160, 104, &Lato_Regular5pt7b);

    // HD
    labelRes = "HD";
    sprite->fillSmoothRoundRect(210, 75, 100, 40, 3, (currentRes == labelRes ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString("HD", 260, 87);

    // Sensor Area

    // Pocket 4K all are Windowed except 4K
    // sprite->drawSmoothRoundRect(20, 120, 5, 3, 290, 40, TFT_DARKGREY); // Optionally draw a rectangle around this info.
    sprite->drawCentreString(currentRes == "4K" ? "FULL SENSOR" :"SENSOR WINDOWED", 165, 129);
    sprite->drawCentreString(currentRecordingFormat.frameWidthHeight_string().c_str(), 165, 150, &Lato_Regular5pt7b);
  }
  else if(currentCodec.basicCodec == CCUPacketTypes::BasicCodec::ProRes)
  {
    // Main label
    sprite->setTextColor(TFT_WHITE);
    sprite->drawString("ProRes RESOLUTION", 30, 9, &AgencyFB_Bold9pt7b);

    String currentRes = currentRecordingFormat.frameDimensionsShort_string().c_str(); // "4K DCI", "4K UHD", "HD"

    // 4K
    String labelRes = "4K DCI";
    sprite->fillSmoothRoundRect(20, 30, 90, 40, 3, (currentRes == labelRes ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString("4K", 65, 36);
    sprite->drawCentreString("DCI", 65, 58, &Lato_Regular5pt7b);

