marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey.cpp
      // 2.8K 5.7K
      sprite->fillSmoothRoundRect(115, 130, 195, 40, 3, (currentRecordingFormat.windowedModeEnabled ? TFT_DARKGREEN : TFT_DARKGREY));
      sprite->drawCentreString("5.3K / 2.8K", 212, 136);
      sprite->drawCentreString("CHECK/SET ON CAMERA", 212, 156, &Lato_Regular5pt7b);
    }
  }
  else
    DEBUG_ERROR("Resolution Pocket 6K - Codec not catered for.");

  sprite->pushSprite(0, 0);
}

// Resolution Screen for URSA Mini Pro G2
void Screen_ResolutionURSAMiniProG2(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Resolution;

  auto camera = BMDControlSystem::getInstance()->getCamera();
  
  // TO DO
}

// Resolution Screen for URSA Mini Pro 12K
void Screen_ResolutionURSAMiniPro12K(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Resolution;

  auto camera = BMDControlSystem::getInstance()->getCamera();
  
  // TO DO
}

// Resolution screen - redirects to appropriate screen for camera
void Screen_Resolution(bool forceRefresh = false)
{
  auto camera = BMDControlSystem::getInstance()->getCamera();

  if(camera->hasCodec())
  {
    if(camera->hasRecordingFormat())
    {
      if(camera->isPocket4K())
        Screen_Resolution4K(forceRefresh); // Pocket 4K
      else if(camera->isPocket6K())
        Screen_Resolution6K(forceRefresh); // Pocket 6K
      else if(camera->isURSAMiniProG2())
        Screen_ResolutionURSAMiniProG2(forceRefresh); // URSA Mini Pro G2
      else if(camera->isURSAMiniPro12K())
        Screen_ResolutionURSAMiniPro12K(forceRefresh); // URSA Mini Pro 12K
      else
        DEBUG_DEBUG("No Codec screen for this camera.");
    } 
    else
      Screen_Resolution4K(forceRefresh); // Handle no model name in 4K screen
  }
  else
    Screen_Resolution4K(forceRefresh); // If we don't have any codec info, we show the 4K screen that shows no codec
}

// Frame Rate screen for Pocket 4K
void Screen_Framerate4K(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Framerate;

  auto camera = BMDControlSystem::getInstance()->getCamera();

  // Pocket 4K Frame Rate

  // Get the current Resolution and Codec
  CCUPacketTypes::RecordingFormatData currentRecordingFormat;
  if(camera->hasRecordingFormat())
    currentRecordingFormat = camera->getRecordingFormat();

  // Get the current Codec values
  CodecInfo currentCodec = camera->getCodec();

  std::string currentFrameRate = currentRecordingFormat.frameRate_string();

  bool tappedAction = false;
  if(btnAPressed || btnBPressed)
  {
    DEBUG_DEBUG("FrameRate4K: Btn A/B pressed");

    short frameRate = 0;
    bool mRateEnabled = false;

    if(currentFrameRate == "23.98")
    {
      if(btnBPressed)
      {
        // 24
        frameRate = 24;
      }
      else
      {
        // 60
        frameRate = 60;
      }
    }
    else if(currentFrameRate == "24")
    {
      if(btnBPressed)
      {
        // 25
        frameRate = 25;
      }
      else
      {
        // 23.98
        frameRate = 24;
        mRateEnabled = true;
      }
    }
    else if(currentFrameRate == "25")
    {
      if(btnBPressed)
      {
        // 29.97
        frameRate = 30;
        mRateEnabled = true;
      }
      else
      {
        // 24
        frameRate = 24;
      }
    }
    else if(currentFrameRate == "29.97")
    {
      if(btnBPressed)
      {
        // 30
        frameRate = 30;
      }
      else
      {
        // 25
        frameRate = 25;
      }
    }
    else if(currentFrameRate == "30")
    {
      if(btnBPressed)
      {
        // 50
        frameRate = 50;
      }
      else
      {
        // 30
        frameRate = 30;
        mRateEnabled = true;
      }
    }
    else if(currentFrameRate == "50")
    {
      if(btnBPressed)
      {
        // 59.94
        frameRate = 60;
        mRateEnabled = true;
      }
      else
      {
        // 30
        frameRate = 30;
      }
    }
    else if(currentFrameRate == "59.94")
    {
      if(btnBPressed)
      {
        // 60
        frameRate = 60;
      }
      else
      {
        // 50
        frameRate = 50;
      }
    }
    else if(currentFrameRate == "60")
    {
      if(btnBPressed)
      {
        // 23.98
        frameRate = 24;
        mRateEnabled = true;
      }
      else
      {
        // 59.94
        frameRate = 60;
        mRateEnabled = true;
      }
    }

    if(frameRate != 0)
    {
      // Frame rate selected, write to camera
      CCUPacketTypes::RecordingFormatData newRecordingFormat = currentRecordingFormat;
      newRecordingFormat.frameRate = frameRate;
      newRecordingFormat.mRateEnabled = mRateEnabled;
      PacketWriter::writeRecordingFormat(newRecordingFormat, &cameraConnection);

      tappedAction = true;
    }
  }

  // If the screen hasn't changed, there were no touch events and we don't have to refresh, return.
  if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh && !tappedAction)
    return;
  else
    lastRefreshedScreen = camera->getLastModified();
  
  DEBUG_DEBUG("Frame Rate Pocket 4K Refreshed.");

  sprite->fillScreen(TFT_BLACK);

  Screen_Common_Connected(); // Common elements

  // Main label
  sprite->setTextColor(TFT_WHITE);
  sprite->drawString("FRAME RATE", 30, 9, &AgencyFB_Bold9pt7b);

  // Output the current Codec and Resolution
  String codecRes = currentCodec.basicCodec == CCUPacketTypes::BasicCodec::BRAW ? "BRAW | " :"ProRes | ";
  codecRes.concat(currentRecordingFormat.frameDimensionsShort_string().c_str());
  sprite->drawString(codecRes, 30, 167);

  sprite->drawString(currentRecordingFormat.frameWidthHeight_string().c_str(), 30, 189, &Lato_Regular5pt7b);

  // 23.98
  std::string labelFR = "23.98";
  sprite->fillSmoothRoundRect(20, 30, 90, 40, 3, (currentFrameRate == labelFR ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString(labelFR.c_str(), 65, 41);

