marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey.cpp
  // 24
  labelFR = "24";
  sprite->fillSmoothRoundRect(115, 30, 90, 40, 3, (currentFrameRate == labelFR ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString(labelFR.c_str(), 160, 41);

  // 25
  labelFR = "25";
  sprite->fillSmoothRoundRect(210, 30, 100, 40, 3, (currentFrameRate == labelFR ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString(labelFR.c_str(), 260, 41);

  // 29.97
  labelFR = "29.97";
  sprite->fillSmoothRoundRect(20, 75, 90, 40, 3, (currentFrameRate == labelFR ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString(labelFR.c_str(), 65, 87);

  // 30
  labelFR = "30";
  sprite->fillSmoothRoundRect(115, 75, 90, 40, 3, (currentFrameRate == labelFR ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString(labelFR.c_str(), 160, 87);

  // 50
  labelFR = "50";
  sprite->fillSmoothRoundRect(210, 75, 100, 40, 3, (currentFrameRate == labelFR ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString(labelFR.c_str(), 260, 87);

  // 59.94
  labelFR = "59.94";
  sprite->fillSmoothRoundRect(20, 120, 90, 40, 3, (currentFrameRate == labelFR ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString(labelFR.c_str(), 65, 131);

  // 60
  labelFR = "60";
  sprite->fillSmoothRoundRect(115, 120, 90, 40, 3, (currentFrameRate == labelFR ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString(labelFR.c_str(), 160, 131);

  sprite->pushSprite(0, 0);
}

// Frame Rate Screen for Pocket 6K
void Screen_Framerate6K(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Framerate;

  auto camera = BMDControlSystem::getInstance()->getCamera();

  // Pocket 6K Frame Rate

  // Get the current Resolution and Codec
  CCUPacketTypes::RecordingFormatData currentRecordingFormat;
  if(camera->hasRecordingFormat())
    currentRecordingFormat = camera->getRecordingFormat();

  // Get the current Codec values
  CodecInfo currentCodec = camera->getCodec();

  std::string currentFrameRate = currentRecordingFormat.frameRate_string();

  bool isFull6K = currentRecordingFormat.width == 6144 && currentRecordingFormat.height == 3456; // Are we in full 6K (only goes up to 50fps)

  bool tappedAction = false;
  if(btnAPressed || btnBPressed)
  {
    DEBUG_DEBUG("FrameRate6K: Btn A/B pressed");

    short frameRate = 0;
    bool mRateEnabled = false;

    if(currentFrameRate == "23.98")
    {
      if(btnBPressed)
      {
        // 24
        frameRate = 24;
      }
      else
      {
        if(isFull6K)
          frameRate = 50;
        else
          frameRate = 60;
      }
    }
    else if(currentFrameRate == "24")
    {
      if(btnBPressed)
      {
        // 25
        frameRate = 25;
      }
      else
      {
        // 23.98
        frameRate = 24;
        mRateEnabled = true;
      }
    }
    else if(currentFrameRate == "25")
    {
      if(btnBPressed)
      {
        // 29.97
        frameRate = 30;
        mRateEnabled = true;
      }
      else
      {
        // 24
        frameRate = 24;
      }
    }
    else if(currentFrameRate == "29.97")
    {
      if(btnBPressed)
      {
        // 30
        frameRate = 30;
      }
      else
      {
        // 25
        frameRate = 25;
      }
    }
    else if(currentFrameRate == "30")
    {
      if(btnBPressed)
      {
        // 50
        frameRate = 50;
      }
      else
      {
        // 30
        frameRate = 30;
        mRateEnabled = true;
      }
    }
    else if(currentFrameRate == "50")
    {
      if(btnBPressed)
      {
        if(isFull6K)
        {
          // 23.98
          frameRate = 24;
          mRateEnabled = true;
        }
        else
        {
          // 59.94
          frameRate = 60;
          mRateEnabled = true;
        }
      }
      else
      {
        // 30
        frameRate = 30;
      }
    }
    else if(currentFrameRate == "59.94")
    {
      if(btnBPressed)
      {
        // 60
        frameRate = 60;
      }
      else
      {
        // 50
        frameRate = 50;
      }
    }
    else if(currentFrameRate == "60")
    {
      if(btnBPressed)
      {
        // 23.98
        frameRate = 24;
        mRateEnabled = true;
      }
      else
      {
        // 59.94
        frameRate = 60;
        mRateEnabled = true;
      }
    }

    if(frameRate != 0)
    {
      // Frame rate selected, write to camera
      CCUPacketTypes::RecordingFormatData newRecordingFormat = currentRecordingFormat;
      newRecordingFormat.frameRate = frameRate;
      newRecordingFormat.mRateEnabled = mRateEnabled;
      PacketWriter::writeRecordingFormat(newRecordingFormat, &cameraConnection);

      tappedAction = true;
    }
  }

  // If the screen hasn't changed, there were no touch events and we don't have to refresh, return.
  if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh && !tappedAction)
    return;
  else
    lastRefreshedScreen = camera->getLastModified();
  
  DEBUG_DEBUG("Frame Rate Pocket 4K Refreshed.");

  sprite->fillScreen(TFT_BLACK);

  Screen_Common_Connected(); // Common elements

  // Main label
  sprite->setTextColor(TFT_WHITE);
  sprite->drawString("FRAME RATE", 30, 9, &AgencyFB_Bold9pt7b);

  // Output the current Codec and Resolution
  String codecRes = currentCodec.basicCodec == CCUPacketTypes::BasicCodec::BRAW ? "BRAW | " :"ProRes | ";
  codecRes.concat(currentRecordingFormat.frameDimensionsShort_string().c_str());
  sprite->drawString(codecRes, 30, 167);

  sprite->drawString(currentRecordingFormat.frameWidthHeight_string().c_str(), 30, 189, &Lato_Regular5pt7b);

  // 23.98
  std::string labelFR = "23.98";
  sprite->fillSmoothRoundRect(20, 30, 90, 40, 3, (currentFrameRate == labelFR ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString(labelFR.c_str(), 65, 41);

  // 24
  labelFR = "24";
  sprite->fillSmoothRoundRect(115, 30, 90, 40, 3, (currentFrameRate == labelFR ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString(labelFR.c_str(), 160, 41);

  // 25
  labelFR = "25";
  sprite->fillSmoothRoundRect(210, 30, 100, 40, 3, (currentFrameRate == labelFR ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString(labelFR.c_str(), 260, 41);

  // 29.97
  labelFR = "29.97";
  sprite->fillSmoothRoundRect(20, 75, 90, 40, 3, (currentFrameRate == labelFR ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString(labelFR.c_str(), 65, 87);

