marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey.cpp
  // 30
  labelFR = "30";
  sprite->fillSmoothRoundRect(115, 75, 90, 40, 3, (currentFrameRate == labelFR ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString(labelFR.c_str(), 160, 87);

  // 50
  labelFR = "50";
  sprite->fillSmoothRoundRect(210, 75, 100, 40, 3, (currentFrameRate == labelFR ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString(labelFR.c_str(), 260, 87);

  if(!isFull6K)
  {
    // 59.94
    labelFR = "59.94";
    sprite->fillSmoothRoundRect(20, 120, 90, 40, 3, (currentFrameRate == labelFR ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString(labelFR.c_str(), 65, 131);

    // 60
    labelFR = "60";
    sprite->fillSmoothRoundRect(115, 120, 90, 40, 3, (currentFrameRate == labelFR ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString(labelFR.c_str(), 160, 131);
  }

  sprite->pushSprite(0, 0);}

// Frame Rate Screen for URSA Mini Pro G2
void Screen_FramerateURSAMiniProG2(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Resolution;

  auto camera = BMDControlSystem::getInstance()->getCamera();
  
  // TO DO
}

// Frame Rate Screen for URSA Mini Pro 12K
void Screen_FramerateURSAMiniPro12K(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Resolution;

  auto camera = BMDControlSystem::getInstance()->getCamera();
  
  // TO DO
}

// Frame Rate screen - redirects to appropriate screen for camera
void Screen_Framerate(bool forceRefresh = false)
{
  auto camera = BMDControlSystem::getInstance()->getCamera();

  if(camera->hasCodec())
  {
    if(camera->hasRecordingFormat())
    {
      if(camera->isPocket4K())
        Screen_Framerate4K(forceRefresh); // Pocket 4K
      else if(camera->isPocket6K())
        Screen_Framerate6K(forceRefresh); // Pocket 6K
      else if(camera->isURSAMiniProG2())
        Screen_FramerateURSAMiniProG2(forceRefresh); // URSA Mini Pro G2
      else if(camera->isURSAMiniPro12K())
        Screen_FramerateURSAMiniPro12K(forceRefresh); // URSA Mini Pro 12K
      else
        DEBUG_DEBUG("No Codec screen for this camera.");
    } 
    else
      Screen_Framerate4K(forceRefresh); // Handle no model name in 4K screen
  }
  else
    Screen_Framerate4K(forceRefresh); // If we don't have any codec info, we show the 4K screen that shows no codec
}


// Media screen for Pocket 4K
void Screen_Media4K6K(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Media;

  auto camera = BMDControlSystem::getInstance()->getCamera();

  // 3 Media Slots - CFAST, SD, USB

  bool tappedAction = false;
  if(btnAPressed || btnBPressed)
  {
    DEBUG_DEBUG("Media Pocket 4K/6K: Btn A/B pressed");

    // Make sure we have some media
    bool hasMedia = camera->getMediaSlots()[0].status != CCUPacketTypes::MediaStatus::None || camera->getMediaSlots()[1].status != CCUPacketTypes::MediaStatus::None || camera->getMediaSlots()[2].status != CCUPacketTypes::MediaStatus::None;

    if(hasMedia)
    {
      TransportInfo transportInfo = camera->getTransportMode();

      bool slotAvail1 = camera->getMediaSlots()[0].status != CCUPacketTypes::MediaStatus::None;
      bool slotAvail2 = camera->getMediaSlots()[1].status != CCUPacketTypes::MediaStatus::None;
      bool slotAvail3 = camera->getMediaSlots()[2].status != CCUPacketTypes::MediaStatus::None;

      // Make sure we have more than one available slot
      if(slotAvail1 + slotAvail2 + slotAvail3 > 1)
      {
        short changeToSlot = -1;
        short slotActive = 0;
        if(slotAvail1 && transportInfo.slots[0].active)
          slotActive = 1;
        else if(slotAvail2 && transportInfo.slots[1].active)
          slotActive = 2;
        else
          slotActive = 3;

        if(btnAPressed)
        {
          // Down to the next
          switch(slotActive)
          {
            case 1:
              changeToSlot = slotAvail2 ? 2 : 3;
              break;
            case 2:
              changeToSlot = slotAvail3 ? 3 : 1;
              break;
            case 3:
              changeToSlot = slotAvail1 ? 1 : 2;
              break;
          }
        }
        else
        {
          // Up to the previous
          switch(slotActive)
          {
            case 1:
              changeToSlot = slotAvail3 ? 3 : 2;
              break;
            case 2:
              changeToSlot = slotAvail1 ? 1 : 3;
              break;
            case 3:
              changeToSlot = slotAvail2 ? 2 : 1;
              break;
          }
        }

        // Change the media slot
        if(changeToSlot != -1)
        {
          transportInfo.slots[0].active = changeToSlot == 1 ? true : false;
          transportInfo.slots[1].active = changeToSlot == 2 ? true : false;
          transportInfo.slots[2].active = changeToSlot == 3 ? true : false;
          PacketWriter::writeTransportInfo(transportInfo, &cameraConnection);

          tappedAction = true;
        }
      }
      else
        DEBUG_DEBUG("Only 1 media available, can't change active media.");
    }
    else
      DEBUG_DEBUG("No media, can't change active media.");
  }

  // If the screen hasn't changed, there were no touch events and we don't have to refresh, return.
  if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh && !tappedAction)
    return;
  else
    lastRefreshedScreen = camera->getLastModified();
  
  DEBUG_DEBUG("Screen Media Pocket 4K/6K Refreshed.");

  sprite->fillScreen(TFT_BLACK);

  Screen_Common_Connected(); // Common elements

    // Media label
  sprite->setTextColor(TFT_WHITE);
  sprite->drawString("MEDIA", 30, 9, &AgencyFB_Bold9pt7b);

  // CFAST
  BMDCamera::MediaSlot cfast = camera->getMediaSlots()[0];
  sprite->fillSmoothRoundRect(20, 30, 295, 40, 3, (cfast.active ? TFT_DARKGREEN : TFT_DARKGREY));
  if(cfast.StatusIsError()) sprite->drawRoundRect(20, 30, 295, 40, 3, (cfast.active ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawString("CFAST", 28, 47);
  if(cfast.status != CCUPacketTypes::MediaStatus::None) sprite->drawString(cfast.remainingRecordTimeString.c_str(), 155, 47);

  if(cfast.status != CCUPacketTypes::MediaStatus::None) sprite->drawString("REMAINING TIME", 155, 35, &Lato_Regular5pt7b);
  sprite->drawString("1", 300, 35, &Lato_Regular5pt7b);
  sprite->drawString(cfast.GetStatusString().c_str(), 28, 35, &Lato_Regular5pt7b);

  // SD
  BMDCamera::MediaSlot sd = camera->getMediaSlots()[1];
  sprite->fillSmoothRoundRect(20, 75, 295, 40, 3, (sd.active ? TFT_DARKGREEN : TFT_DARKGREY));
  if(sd.StatusIsError()) sprite->drawRoundRect(20, 75, 295, 40, 3, (sd.active ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawString("SD", 28, 92);
  if(sd.status != CCUPacketTypes::MediaStatus::None) sprite->drawString(sd.remainingRecordTimeString.c_str(), 155, 92);

