marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey.cpp
  if(sd.status != CCUPacketTypes::MediaStatus::None) sprite->drawString("REMAINING TIME", 155, 80, &Lato_Regular5pt7b);
  sprite->drawString("2", 300, 80, &Lato_Regular5pt7b);
  sprite->drawString(sd.GetStatusString().c_str(), 28, 80, &Lato_Regular5pt7b);
  if(sd.StatusIsError()) sprite->setTextColor(TFT_WHITE);

  // USB
  BMDCamera::MediaSlot usb = camera->getMediaSlots()[2];
  sprite->fillSmoothRoundRect(20, 120, 295, 40, 3, (usb.active ? TFT_DARKGREEN : TFT_DARKGREY));
  if(usb.StatusIsError()) sprite->drawRoundRect(20, 120, 295, 40, 3, (usb.active ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawString("USB", 28, 137);
  if(usb.status != CCUPacketTypes::MediaStatus::None) sprite->drawString(usb.remainingRecordTimeString.c_str(), 155, 137);
  
  if(usb.status != CCUPacketTypes::MediaStatus::None) sprite->drawString("REMAINING TIME", 155, 125, &Lato_Regular5pt7b);
  sprite->drawString("3", 300, 125, &Lato_Regular5pt7b);
  sprite->drawString(usb.GetStatusString().c_str(), 28, 125, &Lato_Regular5pt7b);
  if(usb.StatusIsError()) sprite->setTextColor(TFT_WHITE);

  sprite->pushSprite(0, 0);
}

// Media Screen for URSA Mini Pro G2
void Screen_MediaURSAMiniProG2(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Media;

  auto camera = BMDControlSystem::getInstance()->getCamera();
  
  // TO DO
}

// Media Screen for URSA Mini Pro 12K
void Screen_MediaURSAMiniPro12K(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Media;

  auto camera = BMDControlSystem::getInstance()->getCamera();
  
  // TO DO
}


// Media screen - redirects to appropriate screen for camera
void Screen_Media(bool forceRefresh = false)
{
  auto camera = BMDControlSystem::getInstance()->getCamera();

  if(camera->getMediaSlots().size() != 0)
  {
    if(camera->hasModelName())
    {
      if(camera->isPocket4K6K())
        Screen_Media4K6K(forceRefresh); // Pocket camera
      else if(camera->isURSAMiniProG2())
        Screen_MediaURSAMiniProG2(forceRefresh); // URSA Mini Pro G2
      else if(camera->isURSAMiniPro12K())
        Screen_MediaURSAMiniPro12K(forceRefresh); // URSA Mini Pro 12K
      else
        DEBUG_DEBUG("No Media screen for this camera.");
    } 
    else
      Screen_Media4K6K(forceRefresh); // Handle no model name in 4K/6K screen
  }
  else
    Screen_Media4K6K(forceRefresh); // If we don't have any media info, we show the 4K/6K screen that shows no media

}

void Screen_Lens(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Lens;

  auto camera = BMDControlSystem::getInstance()->getCamera();

  bool tappedAction = false;
  if(btnAPressed || btnBPressed)
  {
    DEBUG_DEBUG("Lens: Btn A/B pressed");

    if(btnAPressed)
    {
      // Focus button
      PacketWriter::writeAutoFocus(&cameraConnection);

      DEBUG_DEBUG("Instantaneous Autofocus");
      
      tappedAction = true;
    }
  }

  // If the screen hasn't changed, there were no touch events and we don't have to refresh, return.
  if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh && !tappedAction)
    return;
  else
    lastRefreshedScreen = camera->getLastModified();

  DEBUG_DEBUG("Screen Lens Refreshed.");

  sprite->fillScreen(TFT_BLACK);

  Screen_Common_Connected(); // Common elements

    // Media label
  sprite->setTextColor(TFT_WHITE);
  sprite->drawString("LENS", 30, 9, &AgencyFB_Bold9pt7b);

  // M5GFX, set font here rather than on each drawString line
  sprite->setFont(&Lato_Regular11pt7b);

  sprite->drawString("LENS TYPE", 30, 53, &Lato_Regular5pt7b);
  if(camera->hasLensType())
  {
    sprite->setTextColor(TFT_LIGHTGREY);
    sprite->drawString(camera->getLensType().c_str(), 30, 35, &Lato_Regular6pt7b);

  }
  
  sprite->drawString("FOCAL LENGTH", 30, 98, &Lato_Regular5pt7b);
  if(camera->hasFocalLengthMM() || camera->hasLensFocalLength())
  {
    if(camera->hasFocalLengthMM())
    {
      auto focalLength = camera->getFocalLengthMM();
      std::string focalLengthMM = std::to_string(focalLength);
      std::string combined = focalLengthMM + "mm";

      sprite->drawString(combined.c_str(), 30, 75, &Lato_Regular12pt7b);
    }
    else
      sprite->drawString(camera->getLensFocalLength().c_str(), 30, 80, &Lato_Regular12pt7b);
  }

  sprite->drawString("LENS DISTANCE", 30, 143, &Lato_Regular5pt7b);
  if(camera->hasLensDistance())
  {
    sprite->drawString(camera->getLensDistance().c_str(), 30, 120, &Lato_Regular12pt7b);
  }

  sprite->drawString("APERTURE", 30, 188, &Lato_Regular5pt7b);
  if(camera->hasApertureFStopString())
  {
    sprite->drawString(camera->getApertureFStopString().c_str(), 30, 165, &Lato_Regular12pt7b);
  }

  sprite->pushSprite(0, 0);
}

void setup() {

  M5.begin();

  tft.setColorDepth(16);
  tft.setSwapBytes(true);

  tft.setTextDatum(TL_DATUM);
  tft.setTextPadding(tft.width());
  tft.setTextColor( TFT_WHITE);
  tft.setTextSize(1);
  tft.setFont(&Lato_Regular11pt7b);

  sprite = new LGFX_Sprite(&tft);
  sprite->setPsram(false);
  sprite->setColorDepth(BPP_SPRITE);
  sprite->setSwapBytes(true);
  sprite->setTextSize(1);
  sprite->setFont(&Lato_Regular11pt7b);


  /* To use Deep Sleep and use button B to wake up, the following code can be used.
      However, as the device won't maintain a connection while asleep, there isn't much point. Power button on the side can be used to shutdown.
      Power off: Quickly double-click the red power button on the left
      If you do want to go to deep sleep in your code, you can run the following code: esp_deep_sleep_start();

  pinMode(GPIO_NUM_38, INPUT_PULLUP); // Button B on M5Stack is GPIO 38, that's the one to wake up from sleep

  // Check if the ESP32 woke up from a deep sleep
  if (esp_sleep_get_wakeup_cause() == ESP_SLEEP_WAKEUP_EXT0) {
    Serial.begin(115200);
    Serial.println("Woke up from sleep!");
    // Additional actions can be performed here after waking up
  } else {
    Serial.begin(115200);
    Serial.println("First boot!");
    // Additional setup can be performed here on the first boot
  }
  // Configure wake-up source
  esp_sleep_enable_ext0_wakeup(GPIO_NUM_38, LOW);
  */

  // SET DEBUG LEVEL
  Debug.setDebugLevel(DBG_VERBOSE);
  Debug.timestampOn();

  // Allow a timeout of 30 seconds for time for the pass key entry. It's slower with buttons
  esp_task_wdt_init(35, true);

  // Splash screen
  tft.pushImage(0, 0, IWIDTH, IHEIGHT, MPCSplash_M5Stack_CoreS3);

  // Prepare for Bluetooth connections and start scanning for cameras
  cameraConnection.initialise(&tft, IWIDTH, IHEIGHT); // Screen Pass Key entry
}

int memoryLoopCounter;
bool forceRecordOutline = false; // Show the recording outline as we haven't done it yet

void loop() {

  dacWrite (25,0); // Silence the speaker as it sometimes makes high-pitched noise on screen refreshes: https://community.m5stack.com/topic/61/noise-on-speaker/16

